pipeTurbulentFlow/relaxationFactors/U/case_4/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    adjustable;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           5;

functions
{
    probes
    {
        type probes;
        libs ("libsampling.so");
        // writeInterval         9.029805575602088e-05; // записывать на каждом временном шаге

        probeLocations
        (
            (0 0 0.05) // точка на входе
            (0 0 0.55) // точка на выходе
        );
        fields (p);
    }
    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeFields     false;  // Отключает запись полей в папки временных шагов
        writeToFile     true;   // Включает запись в yPlus.dat
    }
}
// ************************************************************************* //
